       IDENTIFICATION DIVISION. 
       PROGRAM-ID. 'HelloWorld'.
       AUTHOR. Shelter-Sys .

       PROCEDURE DIVISION.
           DISPLAY 'Hello World!!' .
           DISPLAY "j'aime le Cobol".
           STOP RUN .
